system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
scale 0.001;
vertices
(
    (0     0   0)
    (11.99 0  -0.419)
    (11.99 0   0.419)
    (0     120  0)
    (11.99 120 -0.419)
    (11.99 120  0.419)
);
blocks
(
    hex (0 3 5 2 0 3 4 1) (120 120 1) simpleGrading (1 1 1)
);
boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (3 4 5 3)
	    (0 1 2 0)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (1 2 5 4)
        );
    }
    front
    {
        type wedge;
        faces
        (
            (0 1 4 3)
        );
    }
    back
    {
        type wedge;
        faces
        (
            (0 3 5 2)
        );
    }
);
// ************************************************************************* //